---
kind: method
id: M:Autodesk.Revit.DB.PaperSourceSetIterator.#ctor
source: html/7f560ffa-8e99-6097-7c16-0269ee2856ed.htm
---
# Autodesk.Revit.DB.PaperSourceSetIterator.#ctor Method

For Internal Use Only.

## Syntax (C#)
```csharp
public PaperSourceSetIterator()
```

## Remarks
This constructor is exposed to enable support for COM interop only. This object should never be created by the developer.